GopalSaraf/Practicals/PSDL/include/proc/pic16f1507.inc
// Register: CLC1GLS2
#define CLC1GLS2 CLC1GLS2
CLC1GLS2                                 equ 0F16h
// bitfield definitions
CLC1GLS2_LC1G3D1N_POSN                   equ 0000h
CLC1GLS2_LC1G3D1N_POSITION               equ 0000h
CLC1GLS2_LC1G3D1N_SIZE                   equ 0001h
CLC1GLS2_LC1G3D1N_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D1N_MASK                   equ 0001h
CLC1GLS2_LC1G3D1T_POSN                   equ 0001h
CLC1GLS2_LC1G3D1T_POSITION               equ 0001h
CLC1GLS2_LC1G3D1T_SIZE                   equ 0001h
CLC1GLS2_LC1G3D1T_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D1T_MASK                   equ 0002h
CLC1GLS2_LC1G3D2N_POSN                   equ 0002h
CLC1GLS2_LC1G3D2N_POSITION               equ 0002h
CLC1GLS2_LC1G3D2N_SIZE                   equ 0001h
CLC1GLS2_LC1G3D2N_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D2N_MASK                   equ 0004h
CLC1GLS2_LC1G3D2T_POSN                   equ 0003h
CLC1GLS2_LC1G3D2T_POSITION               equ 0003h
CLC1GLS2_LC1G3D2T_SIZE                   equ 0001h
CLC1GLS2_LC1G3D2T_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D2T_MASK                   equ 0008h
CLC1GLS2_LC1G3D3N_POSN                   equ 0004h
CLC1GLS2_LC1G3D3N_POSITION               equ 0004h
CLC1GLS2_LC1G3D3N_SIZE                   equ 0001h
CLC1GLS2_LC1G3D3N_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D3N_MASK                   equ 0010h
CLC1GLS2_LC1G3D3T_POSN                   equ 0005h
CLC1GLS2_LC1G3D3T_POSITION               equ 0005h
CLC1GLS2_LC1G3D3T_SIZE                   equ 0001h
CLC1GLS2_LC1G3D3T_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D3T_MASK                   equ 0020h
CLC1GLS2_LC1G3D4N_POSN                   equ 0006h
CLC1GLS2_LC1G3D4N_POSITION               equ 0006h
CLC1GLS2_LC1G3D4N_SIZE                   equ 0001h
CLC1GLS2_LC1G3D4N_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D4N_MASK                   equ 0040h
CLC1GLS2_LC1G3D4T_POSN                   equ 0007h
CLC1GLS2_LC1G3D4T_POSITION               equ 0007h
CLC1GLS2_LC1G3D4T_SIZE                   equ 0001h
CLC1GLS2_LC1G3D4T_LENGTH                 equ 0001h
CLC1GLS2_LC1G3D4T_MASK                   equ 0080h
CLC1GLS2_D1N_POSN                        equ 0000h
CLC1GLS2_D1N_POSITION                    equ 0000h
CLC1GLS2_D1N_SIZE                        equ 0001h
CLC1GLS2_D1N_LENGTH                      equ 0001h
CLC1GLS2_D1N_MASK                        equ 0001h
CLC1GLS2_D1T_POSN                        equ 0001h
CLC1GLS2_D1T_POSITION                    equ 0001h
CLC1GLS2_D1T_SIZE                        equ 0001h
CLC1GLS2_D1T_LENGTH                      equ 0001h
CLC1GLS2_D1T_MASK                        equ 0002h
CLC1GLS2_D2N_POSN                        equ 0002h
CLC1GLS2_D2N_POSITION                    equ 0002h
CLC1GLS2_D2N_SIZE                        equ 0001h
CLC1GLS2_D2N_LENGTH                      equ 0001h
CLC1GLS2_D2N_MASK                        equ 0004h
CLC1GLS2_D2T_POSN                        equ 0003h
CLC1GLS2_D2T_POSITION                    equ 0003h
CLC1GLS2_D2T_SIZE                        equ 0001h
CLC1GLS2_D2T_LENGTH                      equ 0001h
CLC1GLS2_D2T_MASK                        equ 0008h
CLC1GLS2_D3N_POSN                        equ 0004h
CLC1GLS2_D3N_POSITION                    equ 0004h
CLC1GLS2_D3N_SIZE                        equ 0001h
CLC1GLS2_D3N_LENGTH                      equ 0001h
CLC1GLS2_D3N_MASK                        equ 0010h
CLC1GLS2_D3T_POSN                        equ 0005h
CLC1GLS2_D3T_POSITION                    equ 0005h
CLC1GLS2_D3T_SIZE                        equ 0001h
CLC1GLS2_D3T_LENGTH                      equ 0001h
CLC1GLS2_D3T_MASK                        equ 0020h
CLC1GLS2_D4N_POSN                        equ 0006h
CLC1GLS2_D4N_POSITION                    equ 0006h
CLC1GLS2_D4N_SIZE                        equ 0001h
CLC1GLS2_D4N_LENGTH                      equ 0001h
CLC1GLS2_D4N_MASK                        equ 0040h
CLC1GLS2_D4T_POSN                        equ 0007h
CLC1GLS2_D4T_POSITION                    equ 0007h
CLC1GLS2_D4T_SIZE                        equ 0001h
CLC1GLS2_D4T_LENGTH                      equ 0001h
CLC1GLS2_D4T_MASK                        equ 0080h

// Register: CLC1GLS3
#define CLC1GLS3 CLC1GLS3
CLC1GLS3                                 equ 0F17h
// bitfield definitions
CLC1GLS3_LC1G4D1N_POSN                   equ 0000h
CLC1GLS3_LC1G4D1N_POSITION               equ 0000h
CLC1GLS3_LC1G4D1N_SIZE                   equ 0001h
CLC1GLS3_LC1G4D1N_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D1N_MASK                   equ 0001h
CLC1GLS3_LC1G4D1T_POSN                   equ 0001h
CLC1GLS3_LC1G4D1T_POSITION               equ 0001h
CLC1GLS3_LC1G4D1T_SIZE                   equ 0001h
CLC1GLS3_LC1G4D1T_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D1T_MASK                   equ 0002h
CLC1GLS3_LC1G4D2N_POSN                   equ 0002h
CLC1GLS3_LC1G4D2N_POSITION               equ 0002h
CLC1GLS3_LC1G4D2N_SIZE                   equ 0001h
CLC1GLS3_LC1G4D2N_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D2N_MASK                   equ 0004h
CLC1GLS3_LC1G4D2T_POSN                   equ 0003h
CLC1GLS3_LC1G4D2T_POSITION               equ 0003h
CLC1GLS3_LC1G4D2T_SIZE                   equ 0001h
CLC1GLS3_LC1G4D2T_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D2T_MASK                   equ 0008h
CLC1GLS3_LC1G4D3N_POSN                   equ 0004h
CLC1GLS3_LC1G4D3N_POSITION               equ 0004h
CLC1GLS3_LC1G4D3N_SIZE                   equ 0001h
CLC1GLS3_LC1G4D3N_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D3N_MASK                   equ 0010h
CLC1GLS3_LC1G4D3T_POSN                   equ 0005h
CLC1GLS3_LC1G4D3T_POSITION               equ 0005h
CLC1GLS3_LC1G4D3T_SIZE                   equ 0001h
CLC1GLS3_LC1G4D3T_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D3T_MASK                   equ 0020h
CLC1GLS3_LC1G4D4N_POSN                   equ 0006h
CLC1GLS3_LC1G4D4N_POSITION               equ 0006h
CLC1GLS3_LC1G4D4N_SIZE                   equ 0001h
CLC1GLS3_LC1G4D4N_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D4N_MASK                   equ 0040h
CLC1GLS3_LC1G4D4T_POSN                   equ 0007h
CLC1GLS3_LC1G4D4T_POSITION               equ 0007h
CLC1GLS3_LC1G4D4T_SIZE                   equ 0001h
CLC1GLS3_LC1G4D4T_LENGTH                 equ 0001h
CLC1GLS3_LC1G4D4T_MASK                   equ 0080h
CLC1GLS3_G4D1N_POSN                      equ 0000h
CLC1GLS3_G4D1N_POSITION                  equ 0000h
CLC1GLS3_G4D1N_SIZE                      equ 0001h
CLC1GLS3_G4D1N_LENGTH                    equ 0001h
CLC1GLS3_G4D1N_MASK                      equ 0001h
CLC1GLS3_G4D1T_POSN                      equ 0001h
CLC1GLS3_G4D1T_POSITION                  equ 0001h
CLC1GLS3_G4D1T_SIZE                      equ 0001h
CLC1GLS3_G4D1T_LENGTH                    equ 0001h
CLC1GLS3_G4D1T_MASK                      equ 0002h
CLC1GLS3_G4D2N_POSN                      equ 0002h
CLC1GLS3_G4D2N_POSITION                  equ 0002h
CLC1GLS3_G4D2N_SIZE                      equ 0001h
CLC1GLS3_G4D2N_LENGTH                    equ 0001h
CLC1GLS3_G4D2N_MASK                      equ 0004h
CLC1GLS3_G4D2T_POSN                      equ 0003h
CLC1GLS3_G4D2T_POSITION                  equ 0003h
CLC1GLS3_G4D2T_SIZE                      equ 0001h
CLC1GLS3_G4D2T_LENGTH                    equ 0001h
CLC1GLS3_G4D2T_MASK                      equ 0008h
CLC1GLS3_G4D3N_POSN                      equ 0004h
CLC1GLS3_G4D3N_POSITION                  equ 0004h
CLC1GLS3_G4D3N_SIZE                      equ 0001h
CLC1GLS3_G4D3N_LENGTH                    equ 0001h
CLC1GLS3_G4D3N_MASK                      equ 0010h
CLC1GLS3_G4D3T_POSN                      equ 0005h
CLC1GLS3_G4D3T_POSITION                  equ 0005h
CLC1GLS3_G4D3T_SIZE                      equ 0001h
CLC1GLS3_G4D3T_LENGTH                    equ 0001h
CLC1GLS3_G4D3T_MASK                      equ 0020h
CLC1GLS3_G4D4N_POSN                      equ 0006h
CLC1GLS3_G4D4N_POSITION                  equ 0006h
CLC1GLS3_G4D4N_SIZE                      equ 0001h
CLC1GLS3_G4D4N_LENGTH                    equ 0001h
CLC1GLS3_G4D4N_MASK                      equ 0040h
CLC1GLS3_G4D4T_POSN                      equ 0007h
CLC1GLS3_G4D4T_POSITION                  equ 0007h
CLC1GLS3_G4D4T_SIZE                      equ 0001h
CLC1GLS3_G4D4T_LENGTH                    equ 0001h
CLC1GLS3_G4D4T_MASK                      equ 0080h

// Register: CLC2CON
#define CLC2CON CLC2CON
CLC2CON                                  equ 0F18h
// bitfield definitions
CLC2CON_LC2MODE0_POSN                    equ 0000h
CLC2CON_LC2MODE0_POSITION                equ 0000h
CLC2CON_LC2MODE0_SIZE                    equ 0001h
CLC2CON_LC2MODE0_LENGTH                  equ 0001h
CLC2CON_LC2MODE0_MASK                    equ 0001h
CLC2CON_LC2MODE1_POSN                    equ 0001h
CLC2CON_LC2MODE1_POSITION                equ 0001h
CLC2CON_LC2MODE1_SIZE                    equ 0001h
CLC2CON_LC2MODE1_LENGTH                  equ 0001h
CLC2CON_LC2MODE1_MASK                    equ 0002h
CLC2CON_LC2MODE2_POSN                    equ 0002h
CLC2CON_LC2MODE2_POSITION                equ 0002h
CLC2CON_LC2MODE2_SIZE                    equ 0001h
CLC2CON_LC2MODE2_LENGTH                  equ 0001h
CLC2CON_LC2MODE2_MASK                    equ 0004h
CLC2CON_LC2INTN_POSN                     equ 0003h
CLC2CON_LC2INTN_POSITION                 equ 0003h
CLC2CON_LC2INTN_SIZE                     equ 0001h
CLC2CON_LC2INTN_LENGTH                   equ 0001h
CLC2CON_LC2INTN_MASK                     equ 0008h
CLC2CON_LC2INTP_POSN                     equ 0004h
CLC2CON_LC2INTP_POSITION                 equ 0004h
CLC2CON_LC2INTP_SIZE                     equ 0001h
CLC2CON_LC2INTP_LENGTH                   equ 0001h
CLC2CON_LC2INTP_MASK                     equ 0010h
CLC2CON_LC2OUT_POSN                      equ 0005h
CLC2CON_LC2OUT_POSITION                  equ 0005h
CLC2CON_LC2OUT_SIZE                      equ 0001h
CLC2CON_LC2OUT_LENGTH                    equ 0001h
CLC2CON_LC2OUT_MASK                      equ 0020h
CLC2CON_LC2OE_POSN                       equ 0006h
CLC2CON_LC2OE_POSITION                   equ 0006h
CLC2CON_LC2OE_SIZE                       equ 0001h
CLC2CON_LC2OE_LENGTH                     equ 0001h
CLC2CON_LC2OE_MASK                       equ 0040h
CLC2CON_LC2EN_POSN                       equ 0007h
CLC2CON_LC2EN_POSITION                   equ 0007h
CLC2CON_LC2EN_SIZE                       equ 0001h
CLC2CON_LC2EN_LENGTH                     equ 0001h
CLC2CON_LC2EN_MASK                       equ 0080h
CLC2CON_LCMODE0_POSN                     equ 0000h
CLC2CON_LCMODE0_POSITION                 equ 0000h
CLC2CON_LCMODE0_SIZE                     equ 0001h
CLC2CON_LCMODE0_LENGTH                   equ 0001h
CLC2CON_LCMODE0_MASK                     equ 0001h
CLC2CON_LCMODE1_POSN                     equ 0001h
CLC2CON_LCMODE1_POSITION                 equ 0001h
CLC2CON_LCMODE1_SIZE                     equ 0001h
CLC2CON_LCMODE1_LENGTH                   equ 0001h
CLC2CON_LCMODE1_MASK                     equ 0002h
CLC2CON_LCMODE2_POSN                     equ 0002h
CLC2CON_LCMODE2_POSITION                 equ 0002h
CLC2CON_LCMODE2_SIZE                     equ 0001h
CLC2CON_LCMODE2_LENGTH                   equ 0001h
CLC2CON_LCMODE2_MASK                     equ 0004h
CLC2CON_LCINTN_POSN                      equ 0003h
CLC2CON_LCINTN_POSITION                  equ 0003h
CLC2CON_LCINTN_SIZE                      equ 0001h
CLC2CON_LCINTN_LENGTH                    equ 0001h
CLC2CON_LCINTN_MASK                      equ 0008h
CLC2CON_LCINTP_POSN                      equ 0004h
CLC2CON_LCINTP_POSITION                  equ 0004h
CLC2CON_LCINTP_SIZE                      equ 0001h
CLC2CON_LCINTP_LENGTH                    equ 0001h
CLC2CON_LCINTP_MASK                      equ 0010h
CLC2CON_LCOUT_POSN                       equ 0005h
CLC2CON_LCOUT_POSITION                   equ 0005h
CLC2CON_LCOUT_SIZE                       equ 0001h
CLC2CON_LCOUT_LENGTH                     equ 0001h
CLC2CON_LCOUT_MASK                       equ 0020h
CLC2CON_LCOE_POSN                        equ 0006h
CLC2CON_LCOE_POSITION                    equ 0006h
CLC2CON_LCOE_SIZE                        equ 0001h
CLC2CON_LCOE_LENGTH                      equ 0001h
CLC2CON_LCOE_MASK                        equ 0040h
CLC2CON_LCEN_POSN                        equ 0007h
CLC2CON_LCEN_POSITION                    equ 0007h
CLC2CON_LCEN_SIZE                        equ 0001h
CLC2CON_LCEN_LENGTH                      equ 0001h
CLC2CON_LCEN_MASK                        equ 0080h
CLC2CON_LC2MODE_POSN                     equ 0000h
CLC2CON_LC2MODE_POSITION                 equ 0000h
CLC2CON_LC2MODE_SIZE                     equ 0003h
CLC2CON_LC2MODE_LENGTH                   equ 0003h
CLC2CON_LC2MODE_MASK                     equ 0007h

// Register: CLC2POL
#define CLC2POL CLC2POL
CLC2POL                                  equ 0F19h
// bitfield definitions
CLC2POL_LC2G1POL_POSN                    equ 0000h
CLC2POL_LC2G1POL_POSITION                equ 0000h
CLC2POL_LC2G1POL_SIZE                    equ 0001h
CLC2POL_LC2G1POL_LENGTH                  equ 0001h
CLC2POL_LC2G1POL_MASK                    equ 0001h
CLC2POL_LC2G2POL_POSN                    equ 0001h
CLC2POL_LC2G2POL_POSITION                equ 0001h
CLC2POL_LC2G2POL_SIZE                    equ 0001h
CLC2POL_LC2G2POL_LENGTH                  equ 0001h
CLC2POL_LC2G2POL_MASK                    equ 0002h
CLC2POL_LC2G3POL_POSN                    equ 0002h
CLC2POL_LC2G3POL_POSITION                equ 0002h
CLC2POL_LC2G3POL_SIZE                    equ 0001h
CLC2POL_LC2G3POL_LENGTH                  equ 0001h
CLC2POL_LC2G3POL_MASK                    equ 0004h
CLC2POL_LC2G4POL_POSN                    equ 0003h
CLC2POL_LC2G4POL_POSITION                equ 0003h
CLC2POL_LC2G4POL_SIZE                    equ 0001h
CLC2POL_LC2G4POL_LENGTH                  equ 0001h
CLC2POL_LC2G4POL_MASK                    equ 0008h
CLC2POL_LC2POL_POSN                      equ 0007h
CLC2POL_LC2POL_POSITION                  equ 0007h
CLC2POL_LC2POL_SIZE                      equ 0001h
CLC2POL_LC2POL_LENGTH                    equ 0001h
CLC2POL_LC2POL_MASK                      equ 0080h
CLC2POL_G1POL_POSN                       equ 0000h
CLC2POL_G1POL_POSITION                   equ 0000h
CLC2POL_G1POL_SIZE                       equ 0001h
CLC2POL_G1POL_LENGTH                     equ 0001h
CLC2POL_G1POL_MASK                       equ 0001h
CLC2POL_G2POL_POSN                       equ 0001h
CLC2POL_G2POL_POSITION                   equ 0001h
CLC2POL_G2POL_SIZE                       equ 0001h
CLC2POL_G2POL_LENGTH                     equ 0001h
CLC2POL_G2POL_MASK                       equ 0002h
CLC2POL_G3POL_POSN                       equ 0002h
CLC2POL_G3POL_POSITION                   equ 0002h
CLC2POL_G3POL_SIZE                       equ 0001h
CLC2POL_G3POL_LENGTH                     equ 0001h
CLC2POL_G3POL_MASK                       equ 0004h
CLC2POL_G4POL_POSN                       equ 0003h
CLC2POL_G4POL_POSITION                   equ 0003h
CLC2POL_G4POL_SIZE                       equ 0001h
CLC2POL_G4POL_LENGTH                     equ 0001h
CLC2POL_G4POL_MASK                       equ 0008h
CLC2POL_POL_POSN                         equ 0007h
CLC2POL_POL_POSITION                     equ 0007h
CLC2POL_POL_SIZE                         equ 0001h
CLC2POL_POL_LENGTH                       equ 0001h
CLC2POL_POL_MASK                         equ 0080h

// Register: CLC2SEL0
#define CLC2SEL0 CLC2SEL0
CLC2SEL0                                 equ 0F1Ah
// bitfield definitions
CLC2SEL0_LC2D1S0_POSN                    equ 0000h
CLC2SEL0_LC2D1S0_POSITION                equ 0000h
CLC2SEL0_LC2D1S0_SIZE                    equ 0001h
CLC2SEL0_LC2D1S0_LENGTH                  equ 0001h
CLC2SEL0_LC2D1S0_MASK                    equ 0001h
CLC2SEL0_LC2D1S1_POSN                    equ 0001h
CLC2SEL0_LC2D1S1_POSITION                equ 0001h
CLC2SEL0_LC2D1S1_SIZE                    equ 0001h
CLC2SEL0_LC2D1S1_LENGTH                  equ 0001h
CLC2SEL0_LC2D1S1_MASK                    equ 0002h
CLC2SEL0_LC2D1S2_POSN                    equ 0002h
CLC2SEL0_LC2D1S2_POSITION                equ 0002h
CLC2SEL0_LC2D1S2_SIZE                    equ 0001h
CLC2SEL0_LC2D1S2_LENGTH                  equ 0001h
CLC2SEL0_LC2D1S2_MASK                    equ 0004h
CLC2SEL0_LC2D2S0_POSN                    equ 0004h
CLC2SEL0_LC2D2S0_POSITION                equ 0004h
CLC2SEL0_LC2D2S0_SIZE                    equ 0001h
CLC2SEL0_LC2D2S0_LENGTH                  equ 0001h
CLC2SEL0_LC2D2S0_MASK                    equ 0010h
CLC2SEL0_LC2D2S1_POSN                    equ 0005h
CLC2SEL0_LC2D2S1_POSITION                equ 0005h
CLC2SEL0_LC2D2S1_SIZE                    equ 0001h
CLC2SEL0_LC2D2S1_LENGTH                  equ 0001h
CLC2SEL0_LC2D2S1_MASK                    equ 0020h
CLC2SEL0_LC2D2S2_POSN                    equ 0006h
CLC2SEL0_LC2D2S2_POSITION                equ 0006h
CLC2SEL0_LC2D2S2_SIZE                    equ 0001h
CLC2SEL0_LC2D2S2_LENGTH                  equ 0001h
CLC2SEL0_LC2D2S2_MASK                    equ 0040h
CLC2SEL0_D1S0_POSN                       equ 0000h
CLC2SEL0_D1S0_POSITION                   equ 0000h
CLC2SEL0_D1S0_SIZE                       equ 0001h
CLC2SEL0_D1S0_LENGTH                     equ 0001h
CLC2SEL0_D1S0_MASK                       equ 0001h
CLC2SEL0_D1S1_POSN                       equ 0001h
CLC2SEL0_D1S1_POSITION                   equ 0001h
CLC2SEL0_D1S1_SIZE                       equ 0001h
CLC2SEL0_D1S1_LENGTH                     equ 0001h
CLC2SEL0_D1S1_MASK                       equ 0002h
CLC2SEL0_D1S2_POSN                       equ 0002h
CLC2SEL0_D1S2_POSITION                   equ 0002h
CLC2SEL0_D1S2_SIZE                       equ 0001h
CLC2SEL0_D1S2_LENGTH                     equ 0001h
CLC2SEL0_D1S2_MASK                       equ 0004h
CLC2SEL0_D2S0_POSN                       equ 0004h
CLC2SEL0_D2S0_POSITION                   equ 0004h
CLC2SEL0_D2S0_SIZE                       equ 0001h
CLC2SEL0_D2S0_LENGTH                     equ 0001h
CLC2SEL0_D2S0_MASK                       equ 0010h
CLC2SEL0_D2S1_POSN                       equ 0005h
CLC2SEL0_D2S1_POSITION                   equ 0005h
CLC2SEL0_D2S1_SIZE                       equ 0001h
CLC2SEL0_D2S1_LENGTH                     equ 0001h
CLC2SEL0_D2S1_MASK                       equ 0020h
CLC2SEL0_D2S2_POSN                       equ 0006h
CLC2SEL0_D2S2_POSITION                   equ 0006h
CLC2SEL0_D2S2_SIZE                       equ 0001h
CLC2SEL0_D2S2_LENGTH                     equ 0001h
CLC2SEL0_D2S2_MASK                       equ 0040h
CLC2SEL0_LC2D1S_POSN                     equ 0000h
CLC2SEL0_LC2D1S_POSITION                 equ 0000h
CLC2SEL0_LC2D1S_SIZE                     equ 0003h
CLC2SEL0_LC2D1S_LENGTH                   equ 0003h
CLC2SEL0_LC2D1S_MASK                     equ 0007h
CLC2SEL0_LC2D2S_POSN                     equ 0004h
CLC2SEL0_LC2D2S_POSITION                 equ 0004h
CLC2SEL0_LC2D2S_SIZE                     equ 0003h
CLC2SEL0_LC2D2S_LENGTH                   equ 0003h
CLC2SEL0_LC2D2S_MASK                     equ 0070h

// Register: CLC2SEL1
#define CLC2SEL1 CLC2SEL1
CLC2SEL1                                 equ 0F1Bh
// bitfield definitions
CLC2SEL1_LC2D3S0_POSN                    equ 0000h
CLC2SEL1_LC2D3S0_POSITION                equ 0000h
CLC2SEL1_LC2D3S0_SIZE                    equ 0001h
CLC2SEL1_LC2D3S0_LENGTH                  equ 0001h
CLC2SEL1_LC2D3S0_MASK                    equ 0001h
CLC2SEL1_LC2D3S1_POSN                    equ 0001h
CLC2SEL1_LC2D3S1_POSITION                equ 0001h
CLC2SEL1_LC2D3S1_SIZE                    equ 0001h
CLC2SEL1_LC2D3S1_LENGTH                  equ 0001h
CLC2SEL1_LC2D3S1_MASK                    equ 0002h
CLC2SEL1_LC2D3S2_POSN                    equ 0002h
CLC2SEL1_LC2D3S2_POSITION                equ 0002h
CLC2SEL1_LC2D3S2_SIZE                    equ 0001h
CLC2SEL1_LC2D3S2_LENGTH                  equ 0001h
CLC2SEL1_LC2D3S2_MASK                    equ 0004h
CLC2SEL1_LC2D4S0_POSN                    equ 0004h
CLC2SEL1_LC2D4S0_POSITION                equ 0004h
CLC2SEL1_LC2D4S0_SIZE                    equ 0001h
CLC2SEL1_LC2D4S0_LENGTH                  equ 0001h
CLC2SEL1_LC2D4S0_MASK                    equ 0010h
CLC2SEL1_LC2D4S1_POSN                    equ 0005h
CLC2SEL1_LC2D4S1_POSITION                equ 0005h
CLC2SEL1_LC2D4S1_SIZE                    equ 0001h
CLC2SEL1_LC2D4S1_LENGTH                  equ 0001h
CLC2SEL1_LC2D4S1_MASK                    equ 0020h
CLC2SEL1_LC2D4S2_POSN                    equ 0006h
CLC2SEL1_LC2D4S2_POSITION                equ 0006h
CLC2SEL1_LC2D4S2_SIZE                    equ 0001h
CLC2SEL1_LC2D4S2_LENGTH                  equ 0001h
CLC2SEL1_LC2D4S2_MASK                    equ 0040h
CLC2SEL1_D3S0_POSN                       equ 0000h
CLC2SEL1_D3S0_POSITION                   equ 0000h
CLC2SEL1_D3S0_SIZE                       equ 0001h
CLC2SEL1_D3S0_LENGTH                     equ 0001h
CLC2SEL1_D3S0_MASK                       equ 0001h
CLC2SEL1_D3S1_POSN                       equ 0001h
CLC2SEL1_D3S1_POSITION                   equ 0001h
CLC2SEL1_D3S1_SIZE                       equ 0001h
CLC2SEL1_D3S1_LENGTH                     equ 0001h
CLC2SEL1_D3S1_MASK                       equ 0002h
CLC2SEL1_D3S2_POSN                       equ 0002h
CLC2SEL1_D3S2_POSITION                   equ 0002h
CLC2SEL1_D3S2_SIZE                       equ 0001h
CLC2SEL1_D3S2_LENGTH                     equ 0001h
CLC2SEL1_D3S2_MASK                       equ 0004h
CLC2SEL1_D4S0_POSN                       equ 0004h
CLC2SEL1_D4S0_POSITION                   equ 0004h
CLC2SEL1_D4S0_SIZE                       equ 0001h
CLC2SEL1_D4S0_LENGTH                     equ 0001h
CLC2SEL1_D4S0_MASK                       equ 0010h
CLC2SEL1_D4S1_POSN                       equ 0005h
CLC2SEL1_D4S1_POSITION                   equ 0005h
CLC2SEL1_D4S1_SIZE                       equ 0001h
CLC2SEL1_D4S1_LENGTH                     equ 0001h
CLC2SEL1_D4S1_MASK                       equ 0020h
CLC2SEL1_D4S2_POSN                       equ 0006h
CLC2SEL1_D4S2_POSITION                   equ 0006h
CLC2SEL1_D4S2_SIZE                       equ 0001h
CLC2SEL1_D4S2_LENGTH                     equ 0001h
CLC2SEL1_D4S2_MASK                       equ 0040h
CLC2SEL1_LC2D3S_POSN                     equ 0000h
CLC2SEL1_LC2D3S_POSITION                 equ 0000h
CLC2SEL1_LC2D3S_SIZE                     equ 0003h
CLC2SEL1_LC2D3S_LENGTH                   equ 0003h
CLC2SEL1_LC2D3S_MASK                     equ 0007h
CLC2SEL1_LC2D4S_POSN                     equ 0004h
CLC2SEL1_LC2D4S_POSITION                 equ 0004h
CLC2SEL1_LC2D4S_SIZE                     equ 0003h
CLC2SEL1_LC2D4S_LENGTH                   equ 0003h
CLC2SEL1_LC2D4S_MASK                     equ 0070h

